l1=[1,3,5,7,9,11,13,15,17,19,21,23,25,27,29]
l2=[2,3,6,7,10,11,14,15,18,19,22,23,26,27,30]
l3=[4,5,6,7,12,13,14,15,20,21,22,23,28,29,30]
l4=[8,9,10,11,12,13,14,15,24,25,26,27,28,29,30]
l5=[16,17,18,19,20,21,22,23,24,25,26,27,28,29,30]
l6=[]
print(l1)
a1=input("是否存在？Y/N ")
if a1=='Y'or a1=='y':
	b1=2**0
	l6.append(b1)
print(l2)
a2=input("是否存在？Y/N ")
if a2=='Y'or a2=='y':
	b2=2**1
	l6.append(b2)

print(l3)
a3=input("是否存在？Y/N ")
if a3=='Y'or a3=='y':
	b3=2**2
	l6.append(b3)

print(l4)
a4=input("是否存在？Y/N ")
if a4=='Y'or a4=='y':
	b4=2**3
	l6.append(b4)

print(l5)
a5=input("是否存在？Y/N ")
if a5=='Y'or a5=='y':
	b5=2**4
	l6.append(b5)

print("你心中的数字是：{0}".format(sum(l6)))